Ran Plan for dir: `projects/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/goboolean/infrastructure/59/default/projects/dev/default.tfplan\"" in "/root/.atlantis/repos/goboolean/infrastructure/59/default/projects/dev": exit status 1
module.iam.google_service_account.atlantis: Refreshing state... [id=projects/goboolean-448812/serviceAccounts/atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gce.google_compute_address.static_ip: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/addresses/atlantis-static-ip]
module.service.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=goboolean-448812/cloudresourcemanager.googleapis.com]
module.gcs.google_storage_bucket.terraform_state: Refreshing state... [id=goboolean-terraform-state]
module.service.google_project_service.services["container.googleapis.com"]: Refreshing state... [id=goboolean-448812/container.googleapis.com]
module.service.google_project_service.services["serviceusage.googleapis.com"]: Refreshing state... [id=goboolean-448812/serviceusage.googleapis.com]
module.service.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=goboolean-448812/iam.googleapis.com]
module.gce.google_compute_firewall.allow_http_https: Refreshing state... [id=projects/goboolean-448812/global/firewalls/allow-http-https]
module.service.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=goboolean-448812/compute.googleapis.com]
module.gke.data.google_container_engine_versions.gke_version: Reading...
module.gke.data.google_container_engine_versions.gke_version: Read complete after 0s [id=2025-01-27 00:31:31.825991235 +0000 UTC]
module.cloudflare.cloudflare_dns_record.atlantis: Refreshing state... [id=b186982eca5758b11d39f8deddbe4c17]
module.iam.google_project_iam_member.gke_admin: Refreshing state... [id=goboolean-448812/roles/container.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.storage_admin: Refreshing state... [id=goboolean-448812/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_network_admin: Refreshing state... [id=goboolean-448812/roles/compute.networkAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_user: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountUser/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.owner: Refreshing state... [id=goboolean-448812/roles/owner/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.iam_admin: Refreshing state... [id=goboolean-448812/roles/resourcemanager.projectIamAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_admin: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_instance_admin: Refreshing state... [id=goboolean-448812/roles/compute.instanceAdmin.v1/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_storage_bucket_iam_member.terraform_state_access: Refreshing state... [id=b/goboolean-terraform-state/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gce.google_compute_instance.default: Refreshing state... [id=projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.gke.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "goboolean-448812-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = (known after apply)
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.gke.google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.10.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "goboolean-448812-subnet"
      + network                    = "goboolean-448812-vpc"
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-northeast3"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "asia-northeast3-a"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "goboolean-448812-gke"
      + network                     = "goboolean-448812-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "goboolean-448812-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + gateway_api_config (known after apply)

      + ip_allocation_policy (known after apply)

      + logging_config (known after apply)

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid index
│ 
│   on ../../modules/gcp/gke/gke.tf line 22, in resource "google_container_node_pool" "primary_nodes":
│   22:   version = data.google_container_engine_versions.gke_version.release_channel_latest_version["REGULAR"]
│     ├────────────────
│     │ data.google_container_engine_versions.gke_version.release_channel_latest_version is empty map of string
│ 
│ The given key does not identify an element in this collection value.
╵


```
</details>

